{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "input_dtype": "float32", "name": "lambda_1", "arguments": {}, "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00c0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-48-68b80bc56fb0>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_regularizer": null, "activation": "linear", "nb_filter": 3, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "W_constraint": null, "border_mode": "valid", "nb_row": 1, "name": "conv0", "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 1}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_regularizer": null, "activation": "elu", "nb_filter": 24, "init": "glorot_uniform", "trainable": true, "subsample": [2, 2], "W_constraint": null, "border_mode": "valid", "nb_row": 3, "name": "convolution2d_1", "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 3}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_regularizer": null, "activation": "elu", "nb_filter": 36, "init": "glorot_uniform", "trainable": true, "subsample": [2, 2], "W_constraint": null, "border_mode": "valid", "nb_row": 3, "name": "convolution2d_2", "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 3}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_regularizer": null, "activation": "elu", "nb_filter": 48, "init": "glorot_uniform", "trainable": true, "subsample": [2, 2], "W_constraint": null, "border_mode": "valid", "nb_row": 3, "name": "convolution2d_3", "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 3}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_regularizer": null, "activation": "elu", "nb_filter": 64, "init": "glorot_uniform", "trainable": true, "subsample": [2, 2], "W_constraint": null, "border_mode": "valid", "nb_row": 3, "name": "convolution2d_4", "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 3}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_regularizer": null, "activation": "elu", "nb_filter": 64, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "W_constraint": null, "border_mode": "valid", "nb_row": 3, "name": "convolution2d_5", "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 3}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "activation": "elu", "output_dim": 100, "init": "glorot_uniform", "trainable": true, "input_dim": 576, "W_constraint": null, "name": "dense_1", "b_constraint": null, "bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_6", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "activation": "elu", "output_dim": 50, "init": "glorot_uniform", "trainable": true, "input_dim": 100, "W_constraint": null, "name": "dense_2", "b_constraint": null, "bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_7", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "activation": "elu", "output_dim": 10, "init": "glorot_uniform", "trainable": true, "input_dim": 50, "W_constraint": null, "name": "dense_3", "b_constraint": null, "bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_8", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "activation": "linear", "output_dim": 1, "init": "glorot_uniform", "trainable": true, "input_dim": 10, "W_constraint": null, "name": "output", "b_constraint": null, "bias": true, "activity_regularizer": null}}]}